quinncnl/Si4463-on-EFM32ZG-STK3200/src/drivers/Si446x/si446x_defs.h
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_MASK 0x3F
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_MSB  5
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_LSB  0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_INDEX 1
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_DONOTHING 0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_TRISTATE 1
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_DRIVE0 2
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_DRIVE1 3
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_INPUT 4
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_32K_CLK 5
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_BOOT_CLK 6
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_DIV_CLK 7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_CTS 8
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_INV_CTS 9
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_CMD_OVERLAP 10
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_SDO 11
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_POR 12
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_CAL_WUT 13
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_WUT 14
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_TX_DATA_CLK 16
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_RX_DATA_CLK 17
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_RX_DATA 20
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_RX_RAW_DATA 21
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_ANTENNA_0_SW 22
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_ANTENNA_1_SW 23
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_VALID_PREAMBLE 24
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_INVALID_PREAMBLE 25
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_SYNC_WORD_DETECT 26
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_CCA 27
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_TX_STATE 32
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_RX_STATE 33
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_RX_FIFO_FULL 34
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_TX_FIFO_EMPTY 35
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_LOW_BATT 36
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_CCA_LATCH 37
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_HOPPED 38
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_HOP_TABLE_WRAP 39
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1_TYPE bitfield
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1_SIZE 8
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1_MASK 0xFF
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1_MSB  7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1_LSB  0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1_INDEX 2
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1_STATE_TYPE bitfield
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1_STATE_SIZE 1
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1_STATE_MASK 0x80
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1_STATE_BIT  0x80
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1_STATE_MSB  7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1_STATE_LSB  7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1_STATE_INDEX 2
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_TYPE bitfield
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_SIZE 6
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_MASK 0x3F
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_MSB  5
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_LSB  0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_INDEX 2
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_DONOTHING 0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_TRISTATE 1
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_DRIVE0 2
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_DRIVE1 3
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_INPUT 4
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_32K_CLK 5
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_BOOT_CLK 6
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_DIV_CLK 7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_CTS 8
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_INV_CTS 9
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_CMD_OVERLAP 10
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_SDO 11
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_POR 12
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_CAL_WUT 13
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_WUT 14
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_TX_DATA_CLK 16
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_RX_DATA_CLK 17
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_RX_DATA 20
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_RX_RAW_DATA 21
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_ANTENNA_0_SW 22
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_ANTENNA_1_SW 23
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_VALID_PREAMBLE 24
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_INVALID_PREAMBLE 25
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_SYNC_WORD_DETECT 26
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_CCA 27
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_TX_STATE 32
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_RX_STATE 33
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_RX_FIFO_FULL 34
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_TX_FIFO_EMPTY 35
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_LOW_BATT 36
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_CCA_LATCH 37
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_HOPPED 38
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_HOP_TABLE_WRAP 39
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2_TYPE bitfield
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2_SIZE 8
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2_MASK 0xFF
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2_MSB  7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2_LSB  0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2_INDEX 3
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2_STATE_TYPE bitfield
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2_STATE_SIZE 1
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2_STATE_MASK 0x80
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2_STATE_BIT  0x80
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2_STATE_MSB  7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2_STATE_LSB  7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2_STATE_INDEX 3
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_TYPE bitfield
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_SIZE 6
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_MASK 0x3F
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_MSB  5
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_LSB  0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_INDEX 3
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_DONOTHING 0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_TRISTATE 1
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_DRIVE0 2
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_DRIVE1 3
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_INPUT 4
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_32K_CLK 5
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_BOOT_CLK 6
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_DIV_CLK 7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_CTS 8
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_INV_CTS 9
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_CMD_OVERLAP 10
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_SDO 11
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_POR 12
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_CAL_WUT 13
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_WUT 14
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_TX_DATA_CLK 16
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_RX_DATA_CLK 17
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_RX_DATA 20
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_RX_RAW_DATA 21
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_ANTENNA_0_SW 22
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_ANTENNA_1_SW 23
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_VALID_PREAMBLE 24
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_INVALID_PREAMBLE 25
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_SYNC_WORD_DETECT 26
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_CCA 27
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_TX_STATE 32
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_RX_STATE 33
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_RX_FIFO_FULL 34
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_TX_FIFO_EMPTY 35
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_LOW_BATT 36
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_CCA_LATCH 37
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_HOPPED 38
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_HOP_TABLE_WRAP 39
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3_TYPE bitfield
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3_SIZE 8
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3_MASK 0xFF
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3_MSB  7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3_LSB  0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3_INDEX 4
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3STATE_TYPE bitfield
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3STATE_SIZE 1
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3STATE_MASK 0x80
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3STATE_BIT  0x80
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3STATE_MSB  7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3STATE_LSB  7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3STATE_INDEX 4
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_TYPE bitfield
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_SIZE 6
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_MASK 0x3F
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_MSB  5
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_LSB  0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_INDEX 4
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_DONOTHING 0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_TRISTATE 1
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_DRIVE0 2
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_DRIVE1 3
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_INPUT 4
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_32K_CLK 5
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_BOOT_CLK 6
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_DIV_CLK 7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_CTS 8
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_INV_CTS 9
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_CMD_OVERLAP 10
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_SDO 11
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_POR 12
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_CAL_WUT 13
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_WUT 14
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_TX_DATA_CLK 16
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_RX_DATA_CLK 17
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_RX_DATA 20
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_RX_RAW_DATA 21
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_ANTENNA_0_SW 22
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_ANTENNA_1_SW 23
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_VALID_PREAMBLE 24
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_INVALID_PREAMBLE 25
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_SYNC_WORD_DETECT 26
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_CCA 27
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_TX_STATE 32
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_RX_STATE 33
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_RX_FIFO_FULL 34
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_TX_FIFO_EMPTY 35
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_LOW_BATT 36
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_CCA_LATCH 37
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_HOPPED 38
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_HOP_TABLE_WRAP 39
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQ_TYPE bitfield
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQ_SIZE 8
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQ_MASK 0xFF
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQ_MSB  7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQ_LSB  0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQ_INDEX 5
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_TYPE bitfield
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_SIZE 1
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_MASK 0x80
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_BIT  0x80
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_MSB  7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_LSB  7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_INDEX 5
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_TYPE bitfield
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_SIZE 6
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_MASK 0x3F
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_MSB  5
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_LSB  0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_INDEX 5
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_DONOTHING 0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_TRISTATE 1
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_DRIVE0 2
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_DRIVE1 3
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_INPUT 4
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_DIV_CLK 7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_CTS 8
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_SDO 11
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_POR 12
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_TX_DATA_CLK 16
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_RX_DATA_CLK 17
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_RX_DATA 20
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_RX_RAW_DATA 21
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_ANTENNA_0_SW 22
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_ANTENNA_1_SW 23
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_VALID_PREAMBLE 24
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_INVALID_PREAMBLE 25
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_SYNC_WORD_DETECT 26
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_CCA 27
    #define SI446X_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_NIRQ 39
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDO_TYPE bitfield
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDO_SIZE 8
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDO_MASK 0xFF
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDO_MSB  7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDO_LSB  0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDO_INDEX 6
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOSTATE_TYPE bitfield
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOSTATE_SIZE 1
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOSTATE_MASK 0x80
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOSTATE_BIT  0x80
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOSTATE_MSB  7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOSTATE_LSB  7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOSTATE_INDEX 6
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_TYPE bitfield
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_SIZE 6
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_MASK 0x3F
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_MSB  5
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_LSB  0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_INDEX 6
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_DONOTHING 0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_TRISTATE 1
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_DRIVE0 2
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_DRIVE1 3
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_INPUT 4
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_32K_CLK 5
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_DIV_CLK 7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_CTS 8
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_SDO 11
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_POR 12
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_WUT 14
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_TX_DATA_CLK 16
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_RX_DATA_CLK 17
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_RX_DATA 20
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_RX_RAW_DATA 21
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_ANTENNA_0_SW 22
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_ANTENNA_1_SW 23
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_VALID_PREAMBLE 24
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_INVALID_PREAMBLE 25
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_SYNC_WORD_DETECT 26
    #define SI446X_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_CCA 27
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GEN_CONFIG_TYPE bitfield
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GEN_CONFIG_SIZE 8
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GEN_CONFIG_MASK 0xFF
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GEN_CONFIG_MSB  7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GEN_CONFIG_LSB  0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_GEN_CONFIG_INDEX 7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_TYPE bitfield
    #define SI446X_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_SIZE 2
    #define SI446X_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_MASK 0x60
    #define SI446X_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_MSB  6
    #define SI446X_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_LSB  5
    #define SI446X_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_INDEX 7
    #define SI446X_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_ENUM_HIGH 0
    #define SI446X_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_ENUM_MED_HIGH 1
    #define SI446X_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_ENUM_MED_LOW 2
    #define SI446X_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_ENUM_LOW 3

