quinncnl/Si4463-on-EFM32ZG-STK3200/src/drivers/Si446x/si446x_defs.h
#define SI446X_CMD_ID_GET_ADC_READING                                          0x14
//GET_ADC_READING ARGS
#define SI446X_CMD_ARG_COUNT_GET_ADC_READING                                   3
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_EN_TYPE bitfield
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_EN_SIZE 8
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_EN_MASK 0xFF
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_EN_MSB  7
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_EN_LSB  0
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_EN_INDEX 1
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_EN_value (((cmd.arg.RAW[1])))
    #define SI446X_CMD_GET_ADC_READING_ARG_TEMPERATURE_EN_TYPE bitfield
    #define SI446X_CMD_GET_ADC_READING_ARG_TEMPERATURE_EN_SIZE 1
    #define SI446X_CMD_GET_ADC_READING_ARG_TEMPERATURE_EN_MASK 0x10
    #define SI446X_CMD_GET_ADC_READING_ARG_TEMPERATURE_EN_BIT  0x10
    #define SI446X_CMD_GET_ADC_READING_ARG_TEMPERATURE_EN_MSB  4
    #define SI446X_CMD_GET_ADC_READING_ARG_TEMPERATURE_EN_LSB  4
    #define SI446X_CMD_GET_ADC_READING_ARG_TEMPERATURE_EN_INDEX 1
    #define SI446X_CMD_GET_ADC_READING_ARG_TEMPERATURE_EN_is_true (cmd.arg.RAW[1]&0x10)
    #define SI446X_CMD_GET_ADC_READING_ARG_TEMPERATURE_EN_value (((cmd.arg.RAW[1]&0x10))>>4)
    #define SI446X_CMD_GET_ADC_READING_ARG_BATTERY_VOLTAGE_EN_TYPE bitfield
    #define SI446X_CMD_GET_ADC_READING_ARG_BATTERY_VOLTAGE_EN_SIZE 1
    #define SI446X_CMD_GET_ADC_READING_ARG_BATTERY_VOLTAGE_EN_MASK 0x08
    #define SI446X_CMD_GET_ADC_READING_ARG_BATTERY_VOLTAGE_EN_BIT  0x08
    #define SI446X_CMD_GET_ADC_READING_ARG_BATTERY_VOLTAGE_EN_MSB  3
    #define SI446X_CMD_GET_ADC_READING_ARG_BATTERY_VOLTAGE_EN_LSB  3
    #define SI446X_CMD_GET_ADC_READING_ARG_BATTERY_VOLTAGE_EN_INDEX 1
    #define SI446X_CMD_GET_ADC_READING_ARG_BATTERY_VOLTAGE_EN_is_true (cmd.arg.RAW[1]&0x8)
    #define SI446X_CMD_GET_ADC_READING_ARG_BATTERY_VOLTAGE_EN_value (((cmd.arg.RAW[1]&0x8))>>3)
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_GPIO_EN_TYPE bitfield
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_GPIO_EN_SIZE 1
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_GPIO_EN_MASK 0x04
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_GPIO_EN_BIT  0x04
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_GPIO_EN_MSB  2
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_GPIO_EN_LSB  2
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_GPIO_EN_INDEX 1
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_GPIO_EN_is_true (cmd.arg.RAW[1]&0x4)
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_GPIO_EN_value (((cmd.arg.RAW[1]&0x4))>>2)
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_GPIO_PIN_TYPE bitfield
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_GPIO_PIN_SIZE 2
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_GPIO_PIN_MASK 0x03
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_GPIO_PIN_MSB  1
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_GPIO_PIN_LSB  0
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_GPIO_PIN_INDEX 1
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_GPIO_PIN_value (((cmd.arg.RAW[1]&0x3)))
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_CFG_TYPE bitfield
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_CFG_SIZE 8
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_CFG_MASK 0xFF
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_CFG_MSB  7
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_CFG_LSB  0
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_CFG_INDEX 2
    #define SI446X_CMD_GET_ADC_READING_ARG_ADC_CFG_value (((cmd.arg.RAW[2])))
    #define SI446X_CMD_GET_ADC_READING_ARG_UDTIME_TYPE bitfield
    #define SI446X_CMD_GET_ADC_READING_ARG_UDTIME_SIZE 4
    #define SI446X_CMD_GET_ADC_READING_ARG_UDTIME_MASK 0xF0
    #define SI446X_CMD_GET_ADC_READING_ARG_UDTIME_MSB  7
    #define SI446X_CMD_GET_ADC_READING_ARG_UDTIME_LSB  4
    #define SI446X_CMD_GET_ADC_READING_ARG_UDTIME_INDEX 2
    #define SI446X_CMD_GET_ADC_READING_ARG_UDTIME_value (((cmd.arg.RAW[2]&0xF0))>>4)
    #define SI446X_CMD_GET_ADC_READING_ARG_GPIO_ATT_TYPE bitfield
    #define SI446X_CMD_GET_ADC_READING_ARG_GPIO_ATT_SIZE 4
    #define SI446X_CMD_GET_ADC_READING_ARG_GPIO_ATT_MASK 0x0F
    #define SI446X_CMD_GET_ADC_READING_ARG_GPIO_ATT_MSB  3
    #define SI446X_CMD_GET_ADC_READING_ARG_GPIO_ATT_LSB  0
    #define SI446X_CMD_GET_ADC_READING_ARG_GPIO_ATT_INDEX 2
    #define SI446X_CMD_GET_ADC_READING_ARG_GPIO_ATT_value (((cmd.arg.RAW[2]&0xF)))
    #define SI446X_CMD_GET_ADC_READING_ARG_GPIO_ATT_ENUM_0P8 0x0
    #define SI446X_CMD_GET_ADC_READING_ARG_GPIO_ATT_ENUM_1P6 0x4
    #define SI446X_CMD_GET_ADC_READING_ARG_GPIO_ATT_ENUM_2P4 0x8
    #define SI446X_CMD_GET_ADC_READING_ARG_GPIO_ATT_ENUM_3P6 0x9
    #define SI446X_CMD_GET_ADC_READING_ARG_GPIO_ATT_ENUM_3P2 0xC
//GET_ADC_READING REPLY
#define SI446X_CMD_REPLY_COUNT_GET_ADC_READING                                 8
    #define SI446X_CMD_GET_ADC_READING_REP_GPIO_ADC_TYPE u16
    #define SI446X_CMD_GET_ADC_READING_REP_GPIO_ADC_SIZE 16
    #define SI446X_CMD_GET_ADC_READING_REP_GPIO_ADC_MASK 0xFFFF
    #define SI446X_CMD_GET_ADC_READING_REP_GPIO_ADC_MSB  15
    #define SI446X_CMD_GET_ADC_READING_REP_GPIO_ADC_LSB  0
    #define SI446X_CMD_GET_ADC_READING_REP_GPIO_ADC_INDEX 1
    #define SI446X_CMD_GET_ADC_READING_REP_BATTERY_ADC_TYPE u16
    #define SI446X_CMD_GET_ADC_READING_REP_BATTERY_ADC_SIZE 16
    #define SI446X_CMD_GET_ADC_READING_REP_BATTERY_ADC_MASK 0xFFFF
    #define SI446X_CMD_GET_ADC_READING_REP_BATTERY_ADC_MSB  15
    #define SI446X_CMD_GET_ADC_READING_REP_BATTERY_ADC_LSB  0
    #define SI446X_CMD_GET_ADC_READING_REP_BATTERY_ADC_INDEX 3
    #define SI446X_CMD_GET_ADC_READING_REP_TEMP_ADC_TYPE u16
    #define SI446X_CMD_GET_ADC_READING_REP_TEMP_ADC_SIZE 16
    #define SI446X_CMD_GET_ADC_READING_REP_TEMP_ADC_MASK 0xFFFF
    #define SI446X_CMD_GET_ADC_READING_REP_TEMP_ADC_MSB  15
    #define SI446X_CMD_GET_ADC_READING_REP_TEMP_ADC_LSB  0
    #define SI446X_CMD_GET_ADC_READING_REP_TEMP_ADC_INDEX 5
    #define SI446X_CMD_GET_ADC_READING_REP_TEMP_SLOPE_TYPE u8
    #define SI446X_CMD_GET_ADC_READING_REP_TEMP_SLOPE_SIZE 8
    #define SI446X_CMD_GET_ADC_READING_REP_TEMP_SLOPE_MASK 0xFF
    #define SI446X_CMD_GET_ADC_READING_REP_TEMP_SLOPE_MSB  7
    #define SI446X_CMD_GET_ADC_READING_REP_TEMP_SLOPE_LSB  0
    #define SI446X_CMD_GET_ADC_READING_REP_TEMP_SLOPE_INDEX 7
    #define SI446X_CMD_GET_ADC_READING_REP_TEMP_INTERCEPT_TYPE u8
    #define SI446X_CMD_GET_ADC_READING_REP_TEMP_INTERCEPT_SIZE 8
    #define SI446X_CMD_GET_ADC_READING_REP_TEMP_INTERCEPT_MASK 0xFF
    #define SI446X_CMD_GET_ADC_READING_REP_TEMP_INTERCEPT_MSB  7
    #define SI446X_CMD_GET_ADC_READING_REP_TEMP_INTERCEPT_LSB  0
    #define SI446X_CMD_GET_ADC_READING_REP_TEMP_INTERCEPT_INDEX 8

#define SI446X_CMD_ID_FIFO_INFO                                                0x15
//FIFO_INFO ARGS
#define SI446X_CMD_ARG_COUNT_FIFO_INFO                                         2
    #define SI446X_CMD_FIFO_INFO_ARG_FIFO_TYPE bitfield
    #define SI446X_CMD_FIFO_INFO_ARG_FIFO_SIZE 8
    #define SI446X_CMD_FIFO_INFO_ARG_FIFO_MASK 0xFF
    #define SI446X_CMD_FIFO_INFO_ARG_FIFO_MSB  7
    #define SI446X_CMD_FIFO_INFO_ARG_FIFO_LSB  0
    #define SI446X_CMD_FIFO_INFO_ARG_FIFO_INDEX 1
    #define SI446X_CMD_FIFO_INFO_ARG_FIFO_value (((cmd.arg.RAW[1])))
    #define SI446X_CMD_FIFO_INFO_ARG_RX_TYPE bitfield
    #define SI446X_CMD_FIFO_INFO_ARG_RX_SIZE 1
    #define SI446X_CMD_FIFO_INFO_ARG_RX_MASK 0x02
    #define SI446X_CMD_FIFO_INFO_ARG_RX_BIT  0x02
    #define SI446X_CMD_FIFO_INFO_ARG_RX_MSB  1
    #define SI446X_CMD_FIFO_INFO_ARG_RX_LSB  1
    #define SI446X_CMD_FIFO_INFO_ARG_RX_INDEX 1
    #define SI446X_CMD_FIFO_INFO_ARG_RX_is_true (cmd.arg.RAW[1]&0x2)
    #define SI446X_CMD_FIFO_INFO_ARG_RX_value (((cmd.arg.RAW[1]&0x2))>>1)
    #define SI446X_CMD_FIFO_INFO_ARG_RX_ENUM_FALSE 0
    #define SI446X_CMD_FIFO_INFO_ARG_RX_ENUM_TRUE 1
    #define SI446X_CMD_FIFO_INFO_ARG_TX_TYPE bitfield
    #define SI446X_CMD_FIFO_INFO_ARG_TX_SIZE 1
    #define SI446X_CMD_FIFO_INFO_ARG_TX_MASK 0x01
    #define SI446X_CMD_FIFO_INFO_ARG_TX_BIT  0x01
    #define SI446X_CMD_FIFO_INFO_ARG_TX_MSB  0
    #define SI446X_CMD_FIFO_INFO_ARG_TX_LSB  0
    #define SI446X_CMD_FIFO_INFO_ARG_TX_INDEX 1
    #define SI446X_CMD_FIFO_INFO_ARG_TX_is_true (cmd.arg.RAW[1]&0x1)
    #define SI446X_CMD_FIFO_INFO_ARG_TX_value (((cmd.arg.RAW[1]&0x1)))
    #define SI446X_CMD_FIFO_INFO_ARG_TX_ENUM_FALSE 0
    #define SI446X_CMD_FIFO_INFO_ARG_TX_ENUM_TRUE 1
//FIFO_INFO REPLY
#define SI446X_CMD_REPLY_COUNT_FIFO_INFO                                       2
    #define SI446X_CMD_FIFO_INFO_REP_RX_FIFO_COUNT_TYPE u8
    #define SI446X_CMD_FIFO_INFO_REP_RX_FIFO_COUNT_SIZE 8
    #define SI446X_CMD_FIFO_INFO_REP_RX_FIFO_COUNT_MASK 0xFF
    #define SI446X_CMD_FIFO_INFO_REP_RX_FIFO_COUNT_MSB  7
    #define SI446X_CMD_FIFO_INFO_REP_RX_FIFO_COUNT_LSB  0
    #define SI446X_CMD_FIFO_INFO_REP_RX_FIFO_COUNT_INDEX 1
    #define SI446X_CMD_FIFO_INFO_REP_TX_FIFO_SPACE_TYPE u8
    #define SI446X_CMD_FIFO_INFO_REP_TX_FIFO_SPACE_SIZE 8
    #define SI446X_CMD_FIFO_INFO_REP_TX_FIFO_SPACE_MASK 0xFF
    #define SI446X_CMD_FIFO_INFO_REP_TX_FIFO_SPACE_MSB  7
    #define SI446X_CMD_FIFO_INFO_REP_TX_FIFO_SPACE_LSB  0
    #define SI446X_CMD_FIFO_INFO_REP_TX_FIFO_SPACE_INDEX 2

#define SI446X_CMD_ID_PACKET_INFO                                              0x16
//PACKET_INFO ARGS
#define SI446X_CMD_ARG_COUNT_PACKET_INFO                                       6
    #define SI446X_CMD_PACKET_INFO_ARG_FIELD_NUMBER_TYPE bitfield
    #define SI446X_CMD_PACKET_INFO_ARG_FIELD_NUMBER_SIZE 8
    #define SI446X_CMD_PACKET_INFO_ARG_FIELD_NUMBER_MASK 0xFF
    #define SI446X_CMD_PACKET_INFO_ARG_FIELD_NUMBER_MSB  7
    #define SI446X_CMD_PACKET_INFO_ARG_FIELD_NUMBER_LSB  0
    #define SI446X_CMD_PACKET_INFO_ARG_FIELD_NUMBER_INDEX 1
    #define SI446X_CMD_PACKET_INFO_ARG_FIELD_NUMBER_value (((cmd.arg.RAW[1])))
    #define SI446X_CMD_PACKET_INFO_ARG_FIELD_NUM_TYPE bitfield
    #define SI446X_CMD_PACKET_INFO_ARG_FIELD_NUM_SIZE 5
    #define SI446X_CMD_PACKET_INFO_ARG_FIELD_NUM_MASK 0x1F
    #define SI446X_CMD_PACKET_INFO_ARG_FIELD_NUM_MSB  4
    #define SI446X_CMD_PACKET_INFO_ARG_FIELD_NUM_LSB  0
    #define SI446X_CMD_PACKET_INFO_ARG_FIELD_NUM_INDEX 1
    #define SI446X_CMD_PACKET_INFO_ARG_FIELD_NUM_value (((cmd.arg.RAW[1]&0x1F)))
    #define SI446X_CMD_PACKET_INFO_ARG_LEN_TYPE u16
    #define SI446X_CMD_PACKET_INFO_ARG_LEN_SIZE 16
    #define SI446X_CMD_PACKET_INFO_ARG_LEN_MASK 0xFFFF
    #define SI446X_CMD_PACKET_INFO_ARG_LEN_MSB  15
    #define SI446X_CMD_PACKET_INFO_ARG_LEN_LSB  0
    #define SI446X_CMD_PACKET_INFO_ARG_LEN_INDEX 2
    #define SI446X_CMD_PACKET_INFO_ARG_LEN_value (((cmd.arg.RAW_u16[1])))
    #define SI446X_CMD_PACKET_INFO_ARG_LEN_MIN 1
    #define SI446X_CMD_PACKET_INFO_ARG_LEN_MAX 8191
    #define SI446X_CMD_PACKET_INFO_ARG_LEN_DIFF_TYPE i16
    #define SI446X_CMD_PACKET_INFO_ARG_LEN_DIFF_SIZE 16
    #define SI446X_CMD_PACKET_INFO_ARG_LEN_DIFF_MASK 0xFFFF
    #define SI446X_CMD_PACKET_INFO_ARG_LEN_DIFF_MSB  15
    #define SI446X_CMD_PACKET_INFO_ARG_LEN_DIFF_LSB  0
    #define SI446X_CMD_PACKET_INFO_ARG_LEN_DIFF_INDEX 4
    #define SI446X_CMD_PACKET_INFO_ARG_LEN_DIFF_value (((i16)(cmd.arg.RAW_i16[2])))
    #define SI446X_CMD_PACKET_INFO_ARG_LEN_DIFF_MIN -32768
    #define SI446X_CMD_PACKET_INFO_ARG_LEN_DIFF_MAX 32767
//PACKET_INFO REPLY
#define SI446X_CMD_REPLY_COUNT_PACKET_INFO                                     2
    #define SI446X_CMD_PACKET_INFO_REP_LENGTH_15_8_TYPE u8
    #define SI446X_CMD_PACKET_INFO_REP_LENGTH_15_8_SIZE 8
    #define SI446X_CMD_PACKET_INFO_REP_LENGTH_15_8_MASK 0xFF
    #define SI446X_CMD_PACKET_INFO_REP_LENGTH_15_8_MSB  7
    #define SI446X_CMD_PACKET_INFO_REP_LENGTH_15_8_LSB  0
    #define SI446X_CMD_PACKET_INFO_REP_LENGTH_15_8_INDEX 1
    #define SI446X_CMD_PACKET_INFO_REP_LENGTH_7_0_TYPE u8
    #define SI446X_CMD_PACKET_INFO_REP_LENGTH_7_0_SIZE 8
    #define SI446X_CMD_PACKET_INFO_REP_LENGTH_7_0_MASK 0xFF
    #define SI446X_CMD_PACKET_INFO_REP_LENGTH_7_0_MSB  7
    #define SI446X_CMD_PACKET_INFO_REP_LENGTH_7_0_LSB  0
    #define SI446X_CMD_PACKET_INFO_REP_LENGTH_7_0_INDEX 2

#define SI446X_CMD_ID_IRCAL                                                    0x17
//IRCAL ARGS
#define SI446X_CMD_ARG_COUNT_IRCAL                                             5
    #define SI446X_CMD_IRCAL_ARG_SEARCHING_STEP_SIZE_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_SEARCHING_STEP_SIZE_SIZE 8
    #define SI446X_CMD_IRCAL_ARG_SEARCHING_STEP_SIZE_MASK 0xFF
    #define SI446X_CMD_IRCAL_ARG_SEARCHING_STEP_SIZE_MSB  7
    #define SI446X_CMD_IRCAL_ARG_SEARCHING_STEP_SIZE_LSB  0
    #define SI446X_CMD_IRCAL_ARG_SEARCHING_STEP_SIZE_INDEX 1
    #define SI446X_CMD_IRCAL_ARG_SEARCHING_STEP_SIZE_value (((cmd.arg.RAW[1])))
    #define SI446X_CMD_IRCAL_ARG_INITIAL_PH_AMP_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_INITIAL_PH_AMP_SIZE 1
    #define SI446X_CMD_IRCAL_ARG_INITIAL_PH_AMP_MASK 0x40
    #define SI446X_CMD_IRCAL_ARG_INITIAL_PH_AMP_BIT  0x40
    #define SI446X_CMD_IRCAL_ARG_INITIAL_PH_AMP_MSB  6
    #define SI446X_CMD_IRCAL_ARG_INITIAL_PH_AMP_LSB  6
    #define SI446X_CMD_IRCAL_ARG_INITIAL_PH_AMP_INDEX 1
    #define SI446X_CMD_IRCAL_ARG_INITIAL_PH_AMP_is_true (cmd.arg.RAW[1]&0x40)
    #define SI446X_CMD_IRCAL_ARG_INITIAL_PH_AMP_value (((cmd.arg.RAW[1]&0x40))>>6)
    #define SI446X_CMD_IRCAL_ARG_FINE_STEP_SIZE_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_FINE_STEP_SIZE_SIZE 2
    #define SI446X_CMD_IRCAL_ARG_FINE_STEP_SIZE_MASK 0x30
    #define SI446X_CMD_IRCAL_ARG_FINE_STEP_SIZE_MSB  5
    #define SI446X_CMD_IRCAL_ARG_FINE_STEP_SIZE_LSB  4
    #define SI446X_CMD_IRCAL_ARG_FINE_STEP_SIZE_INDEX 1
    #define SI446X_CMD_IRCAL_ARG_FINE_STEP_SIZE_value (((cmd.arg.RAW[1]&0x30))>>4)
    #define SI446X_CMD_IRCAL_ARG_FINE_STEP_SIZE_MIN 0
    #define SI446X_CMD_IRCAL_ARG_FINE_STEP_SIZE_MAX 3
    #define SI446X_CMD_IRCAL_ARG_COARSE_STEP_SIZE_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_COARSE_STEP_SIZE_SIZE 4
    #define SI446X_CMD_IRCAL_ARG_COARSE_STEP_SIZE_MASK 0x0F
    #define SI446X_CMD_IRCAL_ARG_COARSE_STEP_SIZE_MSB  3
    #define SI446X_CMD_IRCAL_ARG_COARSE_STEP_SIZE_LSB  0
    #define SI446X_CMD_IRCAL_ARG_COARSE_STEP_SIZE_INDEX 1
    #define SI446X_CMD_IRCAL_ARG_COARSE_STEP_SIZE_value (((cmd.arg.RAW[1]&0xF)))
    #define SI446X_CMD_IRCAL_ARG_COARSE_STEP_SIZE_MIN 0
    #define SI446X_CMD_IRCAL_ARG_COARSE_STEP_SIZE_MAX 15
    #define SI446X_CMD_IRCAL_ARG_SEARCHING_RSSI_AVG_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_SEARCHING_RSSI_AVG_SIZE 8
    #define SI446X_CMD_IRCAL_ARG_SEARCHING_RSSI_AVG_MASK 0xFF
    #define SI446X_CMD_IRCAL_ARG_SEARCHING_RSSI_AVG_MSB  7
    #define SI446X_CMD_IRCAL_ARG_SEARCHING_RSSI_AVG_LSB  0
    #define SI446X_CMD_IRCAL_ARG_SEARCHING_RSSI_AVG_INDEX 2
    #define SI446X_CMD_IRCAL_ARG_SEARCHING_RSSI_AVG_value (((cmd.arg.RAW[2])))
    #define SI446X_CMD_IRCAL_ARG_STEP_BY_STEP_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_STEP_BY_STEP_SIZE 1
    #define SI446X_CMD_IRCAL_ARG_STEP_BY_STEP_MASK 0x80
    #define SI446X_CMD_IRCAL_ARG_STEP_BY_STEP_BIT  0x80
    #define SI446X_CMD_IRCAL_ARG_STEP_BY_STEP_MSB  7
    #define SI446X_CMD_IRCAL_ARG_STEP_BY_STEP_LSB  7
    #define SI446X_CMD_IRCAL_ARG_STEP_BY_STEP_INDEX 2
    #define SI446X_CMD_IRCAL_ARG_STEP_BY_STEP_is_true (cmd.arg.RAW[2]&0x80)
    #define SI446X_CMD_IRCAL_ARG_STEP_BY_STEP_value (((cmd.arg.RAW[2]&0x80))>>7)
    #define SI446X_CMD_IRCAL_ARG_SKIP_INIT_SEARCH_STAT_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_SKIP_INIT_SEARCH_STAT_SIZE 1
    #define SI446X_CMD_IRCAL_ARG_SKIP_INIT_SEARCH_STAT_MASK 0x40
    #define SI446X_CMD_IRCAL_ARG_SKIP_INIT_SEARCH_STAT_BIT  0x40
    #define SI446X_CMD_IRCAL_ARG_SKIP_INIT_SEARCH_STAT_MSB  6
    #define SI446X_CMD_IRCAL_ARG_SKIP_INIT_SEARCH_STAT_LSB  6
    #define SI446X_CMD_IRCAL_ARG_SKIP_INIT_SEARCH_STAT_INDEX 2
    #define SI446X_CMD_IRCAL_ARG_SKIP_INIT_SEARCH_STAT_is_true (cmd.arg.RAW[2]&0x40)
    #define SI446X_CMD_IRCAL_ARG_SKIP_INIT_SEARCH_STAT_value (((cmd.arg.RAW[2]&0x40))>>6)
    #define SI446X_CMD_IRCAL_ARG_RSSI_FINE_AVG_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_RSSI_FINE_AVG_SIZE 2
    #define SI446X_CMD_IRCAL_ARG_RSSI_FINE_AVG_MASK 0x30
    #define SI446X_CMD_IRCAL_ARG_RSSI_FINE_AVG_MSB  5
    #define SI446X_CMD_IRCAL_ARG_RSSI_FINE_AVG_LSB  4
    #define SI446X_CMD_IRCAL_ARG_RSSI_FINE_AVG_INDEX 2
    #define SI446X_CMD_IRCAL_ARG_RSSI_FINE_AVG_value (((cmd.arg.RAW[2]&0x30))>>4)
    #define SI446X_CMD_IRCAL_ARG_RSSI_COARSE_AVG_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_RSSI_COARSE_AVG_SIZE 2
    #define SI446X_CMD_IRCAL_ARG_RSSI_COARSE_AVG_MASK 0x03
    #define SI446X_CMD_IRCAL_ARG_RSSI_COARSE_AVG_MSB  1
    #define SI446X_CMD_IRCAL_ARG_RSSI_COARSE_AVG_LSB  0
    #define SI446X_CMD_IRCAL_ARG_RSSI_COARSE_AVG_INDEX 2
    #define SI446X_CMD_IRCAL_ARG_RSSI_COARSE_AVG_value (((cmd.arg.RAW[2]&0x3)))
    #define SI446X_CMD_IRCAL_ARG_SKIP_CAL_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_SKIP_CAL_SIZE 1
    #define SI446X_CMD_IRCAL_ARG_SKIP_CAL_MASK 0x04
    #define SI446X_CMD_IRCAL_ARG_SKIP_CAL_BIT  0x04
    #define SI446X_CMD_IRCAL_ARG_SKIP_CAL_MSB  2
    #define SI446X_CMD_IRCAL_ARG_SKIP_CAL_LSB  2
    #define SI446X_CMD_IRCAL_ARG_SKIP_CAL_INDEX 2
    #define SI446X_CMD_IRCAL_ARG_SKIP_CAL_is_true (cmd.arg.RAW[2]&0x4)
    #define SI446X_CMD_IRCAL_ARG_SKIP_CAL_value (((cmd.arg.RAW[2]&0x4))>>2)
    #define SI446X_CMD_IRCAL_ARG_RSSI_COURSE_AVG_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_RSSI_COURSE_AVG_SIZE 2
    #define SI446X_CMD_IRCAL_ARG_RSSI_COURSE_AVG_MASK 0x03
    #define SI446X_CMD_IRCAL_ARG_RSSI_COURSE_AVG_MSB  1
    #define SI446X_CMD_IRCAL_ARG_RSSI_COURSE_AVG_LSB  0
    #define SI446X_CMD_IRCAL_ARG_RSSI_COURSE_AVG_INDEX 2
    #define SI446X_CMD_IRCAL_ARG_RSSI_COURSE_AVG_value (((cmd.arg.RAW[2]&0x3)))
    #define SI446X_CMD_IRCAL_ARG_RX_CHAIN_SETTING1_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_RX_CHAIN_SETTING1_SIZE 8
    #define SI446X_CMD_IRCAL_ARG_RX_CHAIN_SETTING1_MASK 0xFF
    #define SI446X_CMD_IRCAL_ARG_RX_CHAIN_SETTING1_MSB  7
    #define SI446X_CMD_IRCAL_ARG_RX_CHAIN_SETTING1_LSB  0
    #define SI446X_CMD_IRCAL_ARG_RX_CHAIN_SETTING1_INDEX 3
    #define SI446X_CMD_IRCAL_ARG_RX_CHAIN_SETTING1_value (((cmd.arg.RAW[3])))
    #define SI446X_CMD_IRCAL_ARG_EN_HRMNIC_GEN_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_EN_HRMNIC_GEN_SIZE 1
    #define SI446X_CMD_IRCAL_ARG_EN_HRMNIC_GEN_MASK 0x80
    #define SI446X_CMD_IRCAL_ARG_EN_HRMNIC_GEN_BIT  0x80
    #define SI446X_CMD_IRCAL_ARG_EN_HRMNIC_GEN_MSB  7
    #define SI446X_CMD_IRCAL_ARG_EN_HRMNIC_GEN_LSB  7
    #define SI446X_CMD_IRCAL_ARG_EN_HRMNIC_GEN_INDEX 3
    #define SI446X_CMD_IRCAL_ARG_EN_HRMNIC_GEN_is_true (cmd.arg.RAW[3]&0x80)
    #define SI446X_CMD_IRCAL_ARG_EN_HRMNIC_GEN_value (((cmd.arg.RAW[3]&0x80))>>7)
    #define SI446X_CMD_IRCAL_ARG_IRCLKDIV_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_IRCLKDIV_SIZE 1
    #define SI446X_CMD_IRCAL_ARG_IRCLKDIV_MASK 0x40
    #define SI446X_CMD_IRCAL_ARG_IRCLKDIV_BIT  0x40
    #define SI446X_CMD_IRCAL_ARG_IRCLKDIV_MSB  6
    #define SI446X_CMD_IRCAL_ARG_IRCLKDIV_LSB  6
    #define SI446X_CMD_IRCAL_ARG_IRCLKDIV_INDEX 3
    #define SI446X_CMD_IRCAL_ARG_IRCLKDIV_is_true (cmd.arg.RAW[3]&0x40)
    #define SI446X_CMD_IRCAL_ARG_IRCLKDIV_value (((cmd.arg.RAW[3]&0x40))>>6)
    #define SI446X_CMD_IRCAL_ARG_RF_SOURCE_PWR_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_RF_SOURCE_PWR_SIZE 2
    #define SI446X_CMD_IRCAL_ARG_RF_SOURCE_PWR_MASK 0x30
    #define SI446X_CMD_IRCAL_ARG_RF_SOURCE_PWR_MSB  5
    #define SI446X_CMD_IRCAL_ARG_RF_SOURCE_PWR_LSB  4
    #define SI446X_CMD_IRCAL_ARG_RF_SOURCE_PWR_INDEX 3
    #define SI446X_CMD_IRCAL_ARG_RF_SOURCE_PWR_value (((cmd.arg.RAW[3]&0x30))>>4)
    #define SI446X_CMD_IRCAL_ARG_CLOSE_SHUNT_SWITCH_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_CLOSE_SHUNT_SWITCH_SIZE 1
    #define SI446X_CMD_IRCAL_ARG_CLOSE_SHUNT_SWITCH_MASK 0x08
    #define SI446X_CMD_IRCAL_ARG_CLOSE_SHUNT_SWITCH_BIT  0x08
    #define SI446X_CMD_IRCAL_ARG_CLOSE_SHUNT_SWITCH_MSB  3
    #define SI446X_CMD_IRCAL_ARG_CLOSE_SHUNT_SWITCH_LSB  3
    #define SI446X_CMD_IRCAL_ARG_CLOSE_SHUNT_SWITCH_INDEX 3
    #define SI446X_CMD_IRCAL_ARG_CLOSE_SHUNT_SWITCH_is_true (cmd.arg.RAW[3]&0x8)
    #define SI446X_CMD_IRCAL_ARG_CLOSE_SHUNT_SWITCH_value (((cmd.arg.RAW[3]&0x8))>>3)
    #define SI446X_CMD_IRCAL_ARG_PGA_GAIN_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_PGA_GAIN_SIZE 3
    #define SI446X_CMD_IRCAL_ARG_PGA_GAIN_MASK 0x07
    #define SI446X_CMD_IRCAL_ARG_PGA_GAIN_MSB  2
    #define SI446X_CMD_IRCAL_ARG_PGA_GAIN_LSB  0
    #define SI446X_CMD_IRCAL_ARG_PGA_GAIN_INDEX 3
    #define SI446X_CMD_IRCAL_ARG_PGA_GAIN_value (((cmd.arg.RAW[3]&0x7)))
    #define SI446X_CMD_IRCAL_ARG_RX_CHAIN_SETTING2_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_RX_CHAIN_SETTING2_SIZE 8
    #define SI446X_CMD_IRCAL_ARG_RX_CHAIN_SETTING2_MASK 0xFF
    #define SI446X_CMD_IRCAL_ARG_RX_CHAIN_SETTING2_MSB  7
    #define SI446X_CMD_IRCAL_ARG_RX_CHAIN_SETTING2_LSB  0
    #define SI446X_CMD_IRCAL_ARG_RX_CHAIN_SETTING2_INDEX 4
    #define SI446X_CMD_IRCAL_ARG_RX_CHAIN_SETTING2_value (((cmd.arg.RAW[4])))
    #define SI446X_CMD_IRCAL_ARG_RSSI_READ_DLEAY_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_RSSI_READ_DLEAY_SIZE 4
    #define SI446X_CMD_IRCAL_ARG_RSSI_READ_DLEAY_MASK 0xF0
    #define SI446X_CMD_IRCAL_ARG_RSSI_READ_DLEAY_MSB  7
    #define SI446X_CMD_IRCAL_ARG_RSSI_READ_DLEAY_LSB  4
    #define SI446X_CMD_IRCAL_ARG_RSSI_READ_DLEAY_INDEX 4
    #define SI446X_CMD_IRCAL_ARG_RSSI_READ_DLEAY_value (((cmd.arg.RAW[4]&0xF0))>>4)
    #define SI446X_CMD_IRCAL_ARG_ADC_HIGH_GAIN_TYPE bitfield
    #define SI446X_CMD_IRCAL_ARG_ADC_HIGH_GAIN_SIZE 1
    #define SI446X_CMD_IRCAL_ARG_ADC_HIGH_GAIN_MASK 0x01
    #define SI446X_CMD_IRCAL_ARG_ADC_HIGH_GAIN_BIT  0x01
    #define SI446X_CMD_IRCAL_ARG_ADC_HIGH_GAIN_MSB  0
    #define SI446X_CMD_IRCAL_ARG_ADC_HIGH_GAIN_LSB  0
    #define SI446X_CMD_IRCAL_ARG_ADC_HIGH_GAIN_INDEX 4
    #define SI446X_CMD_IRCAL_ARG_ADC_HIGH_GAIN_is_true (cmd.arg.RAW[4]&0x1)
    #define SI446X_CMD_IRCAL_ARG_ADC_HIGH_GAIN_value (((cmd.arg.RAW[4]&0x1)))
//IRCAL REPLY
#define SI446X_CMD_REPLY_COUNT_IRCAL                                           3
    #define SI446X_CMD_IRCAL_REP_CAL_STATE_TYPE u8
    #define SI446X_CMD_IRCAL_REP_CAL_STATE_SIZE 8
    #define SI446X_CMD_IRCAL_REP_CAL_STATE_MASK 0xFF
    #define SI446X_CMD_IRCAL_REP_CAL_STATE_MSB  7
    #define SI446X_CMD_IRCAL_REP_CAL_STATE_LSB  0
    #define SI446X_CMD_IRCAL_REP_CAL_STATE_INDEX 1
    #define SI446X_CMD_IRCAL_REP_RSSI_TYPE u8
    #define SI446X_CMD_IRCAL_REP_RSSI_SIZE 8
    #define SI446X_CMD_IRCAL_REP_RSSI_MASK 0xFF
    #define SI446X_CMD_IRCAL_REP_RSSI_MSB  7
    #define SI446X_CMD_IRCAL_REP_RSSI_LSB  0
    #define SI446X_CMD_IRCAL_REP_RSSI_INDEX 2
    #define SI446X_CMD_IRCAL_REP_DIR_CH_TYPE u8
    #define SI446X_CMD_IRCAL_REP_DIR_CH_SIZE 8
    #define SI446X_CMD_IRCAL_REP_DIR_CH_MASK 0xFF
    #define SI446X_CMD_IRCAL_REP_DIR_CH_MSB  7
    #define SI446X_CMD_IRCAL_REP_DIR_CH_LSB  0
    #define SI446X_CMD_IRCAL_REP_DIR_CH_INDEX 3

