quinncnl/Si4463-on-EFM32ZG-STK3200/src/drivers/Si446x/si446x_defs.h
#define SI446X_CMD_ID_GET_CHIP_STATUS                                          0x23
//GET_CHIP_STATUS ARGS
#define SI446X_CMD_ARG_COUNT_GET_CHIP_STATUS                                   1
//GET_CHIP_STATUS REPLY
#define SI446X_CMD_REPLY_COUNT_GET_CHIP_STATUS                                 3
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_PEND_TYPE bitfield
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_PEND_SIZE 8
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_PEND_MASK 0xFF
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_PEND_MSB  7
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_PEND_LSB  0
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_PEND_INDEX 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CAL_PEND_TYPE bitfield
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CAL_PEND_SIZE 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CAL_PEND_MASK 0x40
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CAL_PEND_BIT  0x40
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CAL_PEND_MSB  6
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CAL_PEND_LSB  6
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CAL_PEND_INDEX 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_TYPE bitfield
    #define SI446X_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_SIZE 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_MASK 0x20
    #define SI446X_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_BIT  0x20
    #define SI446X_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_MSB  5
    #define SI446X_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_LSB  5
    #define SI446X_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_INDEX 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_PEND_TYPE bitfield
    #define SI446X_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_PEND_SIZE 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_PEND_MASK 0x10
    #define SI446X_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_PEND_BIT  0x10
    #define SI446X_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_PEND_MSB  4
    #define SI446X_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_PEND_LSB  4
    #define SI446X_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_PEND_INDEX 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_PEND_TYPE bitfield
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_PEND_SIZE 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_PEND_MASK 0x08
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_PEND_BIT  0x08
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_PEND_MSB  3
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_PEND_LSB  3
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_PEND_INDEX 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_READY_PEND_TYPE bitfield
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_READY_PEND_SIZE 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_READY_PEND_MASK 0x04
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_READY_PEND_BIT  0x04
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_READY_PEND_MSB  2
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_READY_PEND_LSB  2
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_READY_PEND_INDEX 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_LOW_BATT_PEND_TYPE bitfield
    #define SI446X_CMD_GET_CHIP_STATUS_REP_LOW_BATT_PEND_SIZE 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_LOW_BATT_PEND_MASK 0x02
    #define SI446X_CMD_GET_CHIP_STATUS_REP_LOW_BATT_PEND_BIT  0x02
    #define SI446X_CMD_GET_CHIP_STATUS_REP_LOW_BATT_PEND_MSB  1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_LOW_BATT_PEND_LSB  1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_LOW_BATT_PEND_INDEX 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_WUT_PEND_TYPE bitfield
    #define SI446X_CMD_GET_CHIP_STATUS_REP_WUT_PEND_SIZE 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_WUT_PEND_MASK 0x01
    #define SI446X_CMD_GET_CHIP_STATUS_REP_WUT_PEND_BIT  0x01
    #define SI446X_CMD_GET_CHIP_STATUS_REP_WUT_PEND_MSB  0
    #define SI446X_CMD_GET_CHIP_STATUS_REP_WUT_PEND_LSB  0
    #define SI446X_CMD_GET_CHIP_STATUS_REP_WUT_PEND_INDEX 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_STATUS_TYPE bitfield
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_STATUS_SIZE 8
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_STATUS_MASK 0xFF
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_STATUS_MSB  7
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_STATUS_LSB  0
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_STATUS_INDEX 2
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CAL_TYPE bitfield
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CAL_SIZE 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CAL_MASK 0x40
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CAL_BIT  0x40
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CAL_MSB  6
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CAL_LSB  6
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CAL_INDEX 2
    #define SI446X_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_TYPE bitfield
    #define SI446X_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_SIZE 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_MASK 0x20
    #define SI446X_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_BIT  0x20
    #define SI446X_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_MSB  5
    #define SI446X_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_LSB  5
    #define SI446X_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_INDEX 2
    #define SI446X_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_TYPE bitfield
    #define SI446X_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_SIZE 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_MASK 0x10
    #define SI446X_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_BIT  0x10
    #define SI446X_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_MSB  4
    #define SI446X_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_LSB  4
    #define SI446X_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_INDEX 2
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_TYPE bitfield
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_SIZE 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_MASK 0x08
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_BIT  0x08
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_MSB  3
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_LSB  3
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_INDEX 2
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_READY_TYPE bitfield
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_READY_SIZE 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_READY_MASK 0x04
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_READY_BIT  0x04
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_READY_MSB  2
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_READY_LSB  2
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CHIP_READY_INDEX 2
    #define SI446X_CMD_GET_CHIP_STATUS_REP_LOW_BATT_TYPE bitfield
    #define SI446X_CMD_GET_CHIP_STATUS_REP_LOW_BATT_SIZE 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_LOW_BATT_MASK 0x02
    #define SI446X_CMD_GET_CHIP_STATUS_REP_LOW_BATT_BIT  0x02
    #define SI446X_CMD_GET_CHIP_STATUS_REP_LOW_BATT_MSB  1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_LOW_BATT_LSB  1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_LOW_BATT_INDEX 2
    #define SI446X_CMD_GET_CHIP_STATUS_REP_WUT_TYPE bitfield
    #define SI446X_CMD_GET_CHIP_STATUS_REP_WUT_SIZE 1
    #define SI446X_CMD_GET_CHIP_STATUS_REP_WUT_MASK 0x01
    #define SI446X_CMD_GET_CHIP_STATUS_REP_WUT_BIT  0x01
    #define SI446X_CMD_GET_CHIP_STATUS_REP_WUT_MSB  0
    #define SI446X_CMD_GET_CHIP_STATUS_REP_WUT_LSB  0
    #define SI446X_CMD_GET_CHIP_STATUS_REP_WUT_INDEX 2
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_TYPE u8
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_SIZE 8
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_MASK 0xFF
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_MSB  7
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_LSB  0
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_INDEX 3
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_ENUM_CMD_ERROR_NONE 0x00
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_ENUM_CMD_ERROR_BAD_COMMAND 0x10
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_ENUM_CMD_ERROR_BAD_ARG 0x11
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_ENUM_CMD_ERROR_COMMAND_BUSY 0x12
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_ENUM_CMD_ERROR_BAD_NVM 0x20
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_ENUM_CMD_ERROR_BAD_PATCH 0x30
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_ENUM_CMD_ERROR_BAD_BOOTMODE 0x31
    #define SI446X_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_ENUM_CMD_ERROR_BAD_PROPERTY 0x40

#define SI446X_CMD_ID_START_TX                                                 0x31
//START_TX ARGS
#define SI446X_CMD_ARG_COUNT_START_TX                                          6
    #define SI446X_CMD_START_TX_ARG_CHANNEL_TYPE u8
    #define SI446X_CMD_START_TX_ARG_CHANNEL_SIZE 8
    #define SI446X_CMD_START_TX_ARG_CHANNEL_MASK 0xFF
    #define SI446X_CMD_START_TX_ARG_CHANNEL_MSB  7
    #define SI446X_CMD_START_TX_ARG_CHANNEL_LSB  0
    #define SI446X_CMD_START_TX_ARG_CHANNEL_INDEX 1
    #define SI446X_CMD_START_TX_ARG_CHANNEL_value (((cmd.arg.RAW[1])))
    #define SI446X_CMD_START_TX_ARG_CHANNEL_MIN 0
    #define SI446X_CMD_START_TX_ARG_CHANNEL_MAX 255
    #define SI446X_CMD_START_TX_ARG_CONDITION_TYPE bitfield
    #define SI446X_CMD_START_TX_ARG_CONDITION_SIZE 8
    #define SI446X_CMD_START_TX_ARG_CONDITION_MASK 0xFF
    #define SI446X_CMD_START_TX_ARG_CONDITION_MSB  7
    #define SI446X_CMD_START_TX_ARG_CONDITION_LSB  0
    #define SI446X_CMD_START_TX_ARG_CONDITION_INDEX 2
    #define SI446X_CMD_START_TX_ARG_CONDITION_value (((cmd.arg.RAW[2])))
    #define SI446X_CMD_START_TX_ARG_TXCOMPLETE_STATE_TYPE bitfield
    #define SI446X_CMD_START_TX_ARG_TXCOMPLETE_STATE_SIZE 4
    #define SI446X_CMD_START_TX_ARG_TXCOMPLETE_STATE_MASK 0xF0
    #define SI446X_CMD_START_TX_ARG_TXCOMPLETE_STATE_MSB  7
    #define SI446X_CMD_START_TX_ARG_TXCOMPLETE_STATE_LSB  4
    #define SI446X_CMD_START_TX_ARG_TXCOMPLETE_STATE_INDEX 2
    #define SI446X_CMD_START_TX_ARG_TXCOMPLETE_STATE_value (((cmd.arg.RAW[2]&0xF0))>>4)
    #define SI446X_CMD_START_TX_ARG_TXCOMPLETE_STATE_ENUM_NOCHANGE 0
    #define SI446X_CMD_START_TX_ARG_TXCOMPLETE_STATE_ENUM_SLEEP 1
    #define SI446X_CMD_START_TX_ARG_TXCOMPLETE_STATE_ENUM_SPI_ACTIVE 2
    #define SI446X_CMD_START_TX_ARG_TXCOMPLETE_STATE_ENUM_READY 3
    #define SI446X_CMD_START_TX_ARG_TXCOMPLETE_STATE_ENUM_READY2 4
    #define SI446X_CMD_START_TX_ARG_TXCOMPLETE_STATE_ENUM_TX_TUNE 5
    #define SI446X_CMD_START_TX_ARG_TXCOMPLETE_STATE_ENUM_RX_TUNE 6
    #define SI446X_CMD_START_TX_ARG_TXCOMPLETE_STATE_ENUM_TX 7
    #define SI446X_CMD_START_TX_ARG_TXCOMPLETE_STATE_ENUM_RX 8
    #define SI446X_CMD_START_TX_ARG_RETRANSMIT_TYPE bitfield
    #define SI446X_CMD_START_TX_ARG_RETRANSMIT_SIZE 1
    #define SI446X_CMD_START_TX_ARG_RETRANSMIT_MASK 0x04
    #define SI446X_CMD_START_TX_ARG_RETRANSMIT_BIT  0x04
    #define SI446X_CMD_START_TX_ARG_RETRANSMIT_MSB  2
    #define SI446X_CMD_START_TX_ARG_RETRANSMIT_LSB  2
    #define SI446X_CMD_START_TX_ARG_RETRANSMIT_INDEX 2
    #define SI446X_CMD_START_TX_ARG_RETRANSMIT_is_true (cmd.arg.RAW[2]&0x4)
    #define SI446X_CMD_START_TX_ARG_RETRANSMIT_value (((cmd.arg.RAW[2]&0x4))>>2)
    #define SI446X_CMD_START_TX_ARG_START_TYPE bitfield
    #define SI446X_CMD_START_TX_ARG_START_SIZE 2
    #define SI446X_CMD_START_TX_ARG_START_MASK 0x03
    #define SI446X_CMD_START_TX_ARG_START_MSB  1
    #define SI446X_CMD_START_TX_ARG_START_LSB  0
    #define SI446X_CMD_START_TX_ARG_START_INDEX 2
    #define SI446X_CMD_START_TX_ARG_START_value (((cmd.arg.RAW[2]&0x3)))
    #define SI446X_CMD_START_TX_ARG_START_ENUM_IMMEDIATE 0
    #define SI446X_CMD_START_TX_ARG_START_ENUM_WUT 1
    #define SI446X_CMD_START_TX_ARG_START_ENUM_UPDATE 3
    #define SI446X_CMD_START_TX_ARG_TX_LEN_TYPE u16
    #define SI446X_CMD_START_TX_ARG_TX_LEN_SIZE 16
    #define SI446X_CMD_START_TX_ARG_TX_LEN_MASK 0xFFFF
    #define SI446X_CMD_START_TX_ARG_TX_LEN_MSB  15
    #define SI446X_CMD_START_TX_ARG_TX_LEN_LSB  0
    #define SI446X_CMD_START_TX_ARG_TX_LEN_INDEX 3
    #define SI446X_CMD_START_TX_ARG_TX_LEN_value (((cmd.arg.RAW_u16[1])))
    #define SI446X_CMD_START_TX_ARG_TX_LEN_MIN 0
    #define SI446X_CMD_START_TX_ARG_TX_LEN_MAX 8191
    #define SI446X_CMD_START_TX_ARG_TX_DELAY_TYPE u8
    #define SI446X_CMD_START_TX_ARG_TX_DELAY_SIZE 8
    #define SI446X_CMD_START_TX_ARG_TX_DELAY_MASK 0xFF
    #define SI446X_CMD_START_TX_ARG_TX_DELAY_MSB  7
    #define SI446X_CMD_START_TX_ARG_TX_DELAY_LSB  0
    #define SI446X_CMD_START_TX_ARG_TX_DELAY_INDEX 5
    #define SI446X_CMD_START_TX_ARG_TX_DELAY_value (((cmd.arg.RAW[5])))
    #define SI446X_CMD_START_TX_ARG_TX_DELAY_MIN 0
    #define SI446X_CMD_START_TX_ARG_TX_DELAY_MAX 128
//START_TX REPLY
#define SI446X_CMD_REPLY_COUNT_START_TX                                        0

#define SI446X_CMD_ID_START_RX                                                 0x32
//START_RX ARGS
#define SI446X_CMD_ARG_COUNT_START_RX                                          8
    #define SI446X_CMD_START_RX_ARG_CHANNEL_TYPE u8
    #define SI446X_CMD_START_RX_ARG_CHANNEL_SIZE 8
    #define SI446X_CMD_START_RX_ARG_CHANNEL_MASK 0xFF
    #define SI446X_CMD_START_RX_ARG_CHANNEL_MSB  7
    #define SI446X_CMD_START_RX_ARG_CHANNEL_LSB  0
    #define SI446X_CMD_START_RX_ARG_CHANNEL_INDEX 1
    #define SI446X_CMD_START_RX_ARG_CHANNEL_value (((cmd.arg.RAW[1])))
    #define SI446X_CMD_START_RX_ARG_CHANNEL_MIN 0
    #define SI446X_CMD_START_RX_ARG_CHANNEL_MAX 255
    #define SI446X_CMD_START_RX_ARG_CONDITION_TYPE bitfield
    #define SI446X_CMD_START_RX_ARG_CONDITION_SIZE 8
    #define SI446X_CMD_START_RX_ARG_CONDITION_MASK 0xFF
    #define SI446X_CMD_START_RX_ARG_CONDITION_MSB  7
    #define SI446X_CMD_START_RX_ARG_CONDITION_LSB  0
    #define SI446X_CMD_START_RX_ARG_CONDITION_INDEX 2
    #define SI446X_CMD_START_RX_ARG_CONDITION_value (((cmd.arg.RAW[2])))
    #define SI446X_CMD_START_RX_ARG_START_TYPE bitfield
    #define SI446X_CMD_START_RX_ARG_START_SIZE 1
    #define SI446X_CMD_START_RX_ARG_START_MASK 0x01
    #define SI446X_CMD_START_RX_ARG_START_BIT  0x01
    #define SI446X_CMD_START_RX_ARG_START_MSB  0
    #define SI446X_CMD_START_RX_ARG_START_LSB  0
    #define SI446X_CMD_START_RX_ARG_START_INDEX 2
    #define SI446X_CMD_START_RX_ARG_START_is_true (cmd.arg.RAW[2]&0x1)
    #define SI446X_CMD_START_RX_ARG_START_value (((cmd.arg.RAW[2]&0x1)))
    #define SI446X_CMD_START_RX_ARG_RX_LEN_TYPE u16
    #define SI446X_CMD_START_RX_ARG_RX_LEN_SIZE 16
    #define SI446X_CMD_START_RX_ARG_RX_LEN_MASK 0xFFFF
    #define SI446X_CMD_START_RX_ARG_RX_LEN_MSB  15
    #define SI446X_CMD_START_RX_ARG_RX_LEN_LSB  0
    #define SI446X_CMD_START_RX_ARG_RX_LEN_INDEX 3
    #define SI446X_CMD_START_RX_ARG_RX_LEN_value (((cmd.arg.RAW_u16[1])))
    #define SI446X_CMD_START_RX_ARG_RX_LEN_MIN 0
    #define SI446X_CMD_START_RX_ARG_RX_LEN_MAX 8191
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE1_TYPE bitfield
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE1_SIZE 8
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE1_MASK 0xFF
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE1_MSB  7
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE1_LSB  0
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE1_INDEX 5
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE1_value (((cmd.arg.RAW[5])))
    #define SI446X_CMD_START_RX_ARG_RXTIMEOUT_STATE_TYPE bitfield
    #define SI446X_CMD_START_RX_ARG_RXTIMEOUT_STATE_SIZE 4
    #define SI446X_CMD_START_RX_ARG_RXTIMEOUT_STATE_MASK 0x0F
    #define SI446X_CMD_START_RX_ARG_RXTIMEOUT_STATE_MSB  3
    #define SI446X_CMD_START_RX_ARG_RXTIMEOUT_STATE_LSB  0
    #define SI446X_CMD_START_RX_ARG_RXTIMEOUT_STATE_INDEX 5
    #define SI446X_CMD_START_RX_ARG_RXTIMEOUT_STATE_value (((cmd.arg.RAW[5]&0xF)))
    #define SI446X_CMD_START_RX_ARG_RXTIMEOUT_STATE_ENUM_NOCHANGE 0
    #define SI446X_CMD_START_RX_ARG_RXTIMEOUT_STATE_ENUM_SLEEP 1
    #define SI446X_CMD_START_RX_ARG_RXTIMEOUT_STATE_ENUM_SPI_ACTIVE 2
    #define SI446X_CMD_START_RX_ARG_RXTIMEOUT_STATE_ENUM_READY 3
    #define SI446X_CMD_START_RX_ARG_RXTIMEOUT_STATE_ENUM_READY2 4
    #define SI446X_CMD_START_RX_ARG_RXTIMEOUT_STATE_ENUM_TX_TUNE 5
    #define SI446X_CMD_START_RX_ARG_RXTIMEOUT_STATE_ENUM_RX_TUNE 6
    #define SI446X_CMD_START_RX_ARG_RXTIMEOUT_STATE_ENUM_TX 7
    #define SI446X_CMD_START_RX_ARG_RXTIMEOUT_STATE_ENUM_RX 8
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE2_TYPE bitfield
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE2_SIZE 8
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE2_MASK 0xFF
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE2_MSB  7
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE2_LSB  0
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE2_INDEX 6
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE2_value (((cmd.arg.RAW[6])))
    #define SI446X_CMD_START_RX_ARG_RXVALID_STATE_TYPE bitfield
    #define SI446X_CMD_START_RX_ARG_RXVALID_STATE_SIZE 4
    #define SI446X_CMD_START_RX_ARG_RXVALID_STATE_MASK 0x0F
    #define SI446X_CMD_START_RX_ARG_RXVALID_STATE_MSB  3
    #define SI446X_CMD_START_RX_ARG_RXVALID_STATE_LSB  0
    #define SI446X_CMD_START_RX_ARG_RXVALID_STATE_INDEX 6
    #define SI446X_CMD_START_RX_ARG_RXVALID_STATE_value (((cmd.arg.RAW[6]&0xF)))
    #define SI446X_CMD_START_RX_ARG_RXVALID_STATE_ENUM_NOCHANGE 0
    #define SI446X_CMD_START_RX_ARG_RXVALID_STATE_ENUM_SLEEP 1
    #define SI446X_CMD_START_RX_ARG_RXVALID_STATE_ENUM_SPI_ACTIVE 2
    #define SI446X_CMD_START_RX_ARG_RXVALID_STATE_ENUM_READY 3
    #define SI446X_CMD_START_RX_ARG_RXVALID_STATE_ENUM_READY2 4
    #define SI446X_CMD_START_RX_ARG_RXVALID_STATE_ENUM_TX_TUNE 5
    #define SI446X_CMD_START_RX_ARG_RXVALID_STATE_ENUM_RX_TUNE 6
    #define SI446X_CMD_START_RX_ARG_RXVALID_STATE_ENUM_TX 7
    #define SI446X_CMD_START_RX_ARG_RXVALID_STATE_ENUM_RX 8
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE3_TYPE bitfield
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE3_SIZE 8
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE3_MASK 0xFF
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE3_MSB  7
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE3_LSB  0
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE3_INDEX 7
    #define SI446X_CMD_START_RX_ARG_NEXT_STATE3_value (((cmd.arg.RAW[7])))
    #define SI446X_CMD_START_RX_ARG_RXINVALID_STATE_TYPE bitfield
    #define SI446X_CMD_START_RX_ARG_RXINVALID_STATE_SIZE 4
    #define SI446X_CMD_START_RX_ARG_RXINVALID_STATE_MASK 0x0F
    #define SI446X_CMD_START_RX_ARG_RXINVALID_STATE_MSB  3
    #define SI446X_CMD_START_RX_ARG_RXINVALID_STATE_LSB  0
    #define SI446X_CMD_START_RX_ARG_RXINVALID_STATE_INDEX 7
    #define SI446X_CMD_START_RX_ARG_RXINVALID_STATE_value (((cmd.arg.RAW[7]&0xF)))
    #define SI446X_CMD_START_RX_ARG_RXINVALID_STATE_ENUM_NOCHANGE 0
    #define SI446X_CMD_START_RX_ARG_RXINVALID_STATE_ENUM_SLEEP 1
    #define SI446X_CMD_START_RX_ARG_RXINVALID_STATE_ENUM_SPI_ACTIVE 2
    #define SI446X_CMD_START_RX_ARG_RXINVALID_STATE_ENUM_READY 3
    #define SI446X_CMD_START_RX_ARG_RXINVALID_STATE_ENUM_READY2 4
    #define SI446X_CMD_START_RX_ARG_RXINVALID_STATE_ENUM_TX_TUNE 5
    #define SI446X_CMD_START_RX_ARG_RXINVALID_STATE_ENUM_RX_TUNE 6
    #define SI446X_CMD_START_RX_ARG_RXINVALID_STATE_ENUM_TX 7
    #define SI446X_CMD_START_RX_ARG_RXINVALID_STATE_ENUM_RX 8
//START_RX REPLY
#define SI446X_CMD_REPLY_COUNT_START_RX                                        0

#define SI446X_CMD_ID_REQUEST_DEVICE_STATE                                     0x33
//REQUEST_DEVICE_STATE ARGS
#define SI446X_CMD_ARG_COUNT_REQUEST_DEVICE_STATE                              1
//REQUEST_DEVICE_STATE REPLY
#define SI446X_CMD_REPLY_COUNT_REQUEST_DEVICE_STATE                            2
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_CURR_STATE_TYPE bitfield
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_CURR_STATE_SIZE 8
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_CURR_STATE_MASK 0xFF
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_CURR_STATE_MSB  7
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_CURR_STATE_LSB  0
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_CURR_STATE_INDEX 1
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_TYPE bitfield
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_SIZE 4
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_MASK 0x0F
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_MSB  3
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_LSB  0
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_INDEX 1
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_ENUM_NOCHANGE 0
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_ENUM_SLEEP 1
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_ENUM_SPI_ACTIVE 2
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_ENUM_READY 3
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_ENUM_READY2 4
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_ENUM_TX_TUNE 5
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_ENUM_RX_TUNE 6
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_ENUM_TX 7
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_ENUM_RX 8
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_CURRENT_CHANNEL_TYPE u8
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_CURRENT_CHANNEL_SIZE 8
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_CURRENT_CHANNEL_MASK 0xFF
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_CURRENT_CHANNEL_MSB  7
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_CURRENT_CHANNEL_LSB  0
    #define SI446X_CMD_REQUEST_DEVICE_STATE_REP_CURRENT_CHANNEL_INDEX 2

#define SI446X_CMD_ID_CHANGE_STATE                                             0x34
//CHANGE_STATE ARGS
#define SI446X_CMD_ARG_COUNT_CHANGE_STATE                                      2
    #define SI446X_CMD_CHANGE_STATE_ARG_NEXT_STATE1_TYPE bitfield
    #define SI446X_CMD_CHANGE_STATE_ARG_NEXT_STATE1_SIZE 8
    #define SI446X_CMD_CHANGE_STATE_ARG_NEXT_STATE1_MASK 0xFF
    #define SI446X_CMD_CHANGE_STATE_ARG_NEXT_STATE1_MSB  7
    #define SI446X_CMD_CHANGE_STATE_ARG_NEXT_STATE1_LSB  0
    #define SI446X_CMD_CHANGE_STATE_ARG_NEXT_STATE1_INDEX 1
    #define SI446X_CMD_CHANGE_STATE_ARG_NEXT_STATE1_value (((cmd.arg.RAW[1])))
    #define SI446X_CMD_CHANGE_STATE_ARG_NEW_STATE_TYPE bitfield
    #define SI446X_CMD_CHANGE_STATE_ARG_NEW_STATE_SIZE 4
    #define SI446X_CMD_CHANGE_STATE_ARG_NEW_STATE_MASK 0x0F
    #define SI446X_CMD_CHANGE_STATE_ARG_NEW_STATE_MSB  3
    #define SI446X_CMD_CHANGE_STATE_ARG_NEW_STATE_LSB  0
    #define SI446X_CMD_CHANGE_STATE_ARG_NEW_STATE_INDEX 1
    #define SI446X_CMD_CHANGE_STATE_ARG_NEW_STATE_value (((cmd.arg.RAW[1]&0xF)))
    #define SI446X_CMD_CHANGE_STATE_ARG_NEW_STATE_ENUM_NOCHANGE 0
    #define SI446X_CMD_CHANGE_STATE_ARG_NEW_STATE_ENUM_SLEEP 1
    #define SI446X_CMD_CHANGE_STATE_ARG_NEW_STATE_ENUM_SPI_ACTIVE 2
    #define SI446X_CMD_CHANGE_STATE_ARG_NEW_STATE_ENUM_READY 3
    #define SI446X_CMD_CHANGE_STATE_ARG_NEW_STATE_ENUM_READY2 4
    #define SI446X_CMD_CHANGE_STATE_ARG_NEW_STATE_ENUM_TX_TUNE 5
    #define SI446X_CMD_CHANGE_STATE_ARG_NEW_STATE_ENUM_RX_TUNE 6
    #define SI446X_CMD_CHANGE_STATE_ARG_NEW_STATE_ENUM_TX 7
    #define SI446X_CMD_CHANGE_STATE_ARG_NEW_STATE_ENUM_RX 8
//CHANGE_STATE REPLY
#define SI446X_CMD_REPLY_COUNT_CHANGE_STATE                                    0

