quinncnl/Si4463-on-EFM32ZG-STK3200/src/drivers/Si446x/si446x_defs.h
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_MASK                                 0xFF
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_DEFAULT                              0x00
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_4FSK_SIZE                            1
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_4FSK_LSB                             4
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_4FSK_MSB                             4
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_4FSK_MASK                            0x10
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_4FSK_BIT                             0x10
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_RESERVED_SIZE                        1
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_RESERVED_LSB                         2
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_RESERVED_MSB                         2
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_RESERVED_MASK                        0x4
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_RESERVED_BIT                         0x4
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_WHITEN_SIZE                          1
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_WHITEN_LSB                           1
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_WHITEN_MSB                           1
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_WHITEN_MASK                          0x2
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_WHITEN_BIT                           0x2
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_MANCH_SIZE                           1
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_MANCH_LSB                            0
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_MANCH_MSB                            0
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_MANCH_MASK                           0x1
#define SI446X_PROP_PKT_RX_FIELD_5_CONFIG_MANCH_BIT                            0x1

#define SI446X_PROP_PKT_RX_FIELD_5_CRC_CONFIG_MASK                             0xFF
#define SI446X_PROP_PKT_RX_FIELD_5_CRC_CONFIG_DEFAULT                          0x00
#define SI446X_PROP_PKT_RX_FIELD_5_CRC_CONFIG_RESERVED_SIZE                    2
#define SI446X_PROP_PKT_RX_FIELD_5_CRC_CONFIG_RESERVED_LSB                     6
#define SI446X_PROP_PKT_RX_FIELD_5_CRC_CONFIG_RESERVED_MSB                     7
#define SI446X_PROP_PKT_RX_FIELD_5_CRC_CONFIG_RESERVED_MASK                    0xC0
#define SI446X_PROP_PKT_RX_FIELD_5_CRC_CONFIG_CHECK_CRC_SIZE                   1
#define SI446X_PROP_PKT_RX_FIELD_5_CRC_CONFIG_CHECK_CRC_LSB                    3
#define SI446X_PROP_PKT_RX_FIELD_5_CRC_CONFIG_CHECK_CRC_MSB                    3
#define SI446X_PROP_PKT_RX_FIELD_5_CRC_CONFIG_CHECK_CRC_MASK                   0x8
#define SI446X_PROP_PKT_RX_FIELD_5_CRC_CONFIG_CHECK_CRC_BIT                    0x8
#define SI446X_PROP_PKT_RX_FIELD_5_CRC_CONFIG_CRC_ENABLE_SIZE                  1
#define SI446X_PROP_PKT_RX_FIELD_5_CRC_CONFIG_CRC_ENABLE_LSB                   1
#define SI446X_PROP_PKT_RX_FIELD_5_CRC_CONFIG_CRC_ENABLE_MSB                   1
#define SI446X_PROP_PKT_RX_FIELD_5_CRC_CONFIG_CRC_ENABLE_MASK                  0x2
#define SI446X_PROP_PKT_RX_FIELD_5_CRC_CONFIG_CRC_ENABLE_BIT                   0x2

#define SI446X_PROP_MODEM_MOD_TYPE_MASK                                        0xFF
#define SI446X_PROP_MODEM_MOD_TYPE_DEFAULT                                     0x02
#define SI446X_PROP_MODEM_MOD_TYPE_TX_DIRECT_MODE_TYPE_SIZE                    1
#define SI446X_PROP_MODEM_MOD_TYPE_TX_DIRECT_MODE_TYPE_LSB                     7
#define SI446X_PROP_MODEM_MOD_TYPE_TX_DIRECT_MODE_TYPE_MSB                     7
#define SI446X_PROP_MODEM_MOD_TYPE_TX_DIRECT_MODE_TYPE_MASK                    0x80
#define SI446X_PROP_MODEM_MOD_TYPE_TX_DIRECT_MODE_TYPE_BIT                     0x80
#define SI446X_PROP_MODEM_MOD_TYPE_TX_DIRECT_MODE_TYPE_ENUM_SYNC               0
#define SI446X_PROP_MODEM_MOD_TYPE_TX_DIRECT_MODE_TYPE_ENUM_ASYNC              1
#define SI446X_PROP_MODEM_MOD_TYPE_TX_DIRECT_MODE_GPIO_SIZE                    2
#define SI446X_PROP_MODEM_MOD_TYPE_TX_DIRECT_MODE_GPIO_LSB                     5
#define SI446X_PROP_MODEM_MOD_TYPE_TX_DIRECT_MODE_GPIO_MSB                     6
#define SI446X_PROP_MODEM_MOD_TYPE_TX_DIRECT_MODE_GPIO_MASK                    0x60
#define SI446X_PROP_MODEM_MOD_TYPE_TX_DIRECT_MODE_GPIO_ENUM_GPIO0              0
#define SI446X_PROP_MODEM_MOD_TYPE_TX_DIRECT_MODE_GPIO_ENUM_GPIO1              1
#define SI446X_PROP_MODEM_MOD_TYPE_TX_DIRECT_MODE_GPIO_ENUM_GPIO2              2
#define SI446X_PROP_MODEM_MOD_TYPE_TX_DIRECT_MODE_GPIO_ENUM_GPIO3              3
#define SI446X_PROP_MODEM_MOD_TYPE_MOD_SOURCE_SIZE                             2
#define SI446X_PROP_MODEM_MOD_TYPE_MOD_SOURCE_LSB                              3
#define SI446X_PROP_MODEM_MOD_TYPE_MOD_SOURCE_MSB                              4
#define SI446X_PROP_MODEM_MOD_TYPE_MOD_SOURCE_MASK                             0x18
#define SI446X_PROP_MODEM_MOD_TYPE_MOD_SOURCE_ENUM_PACKET                      0
#define SI446X_PROP_MODEM_MOD_TYPE_MOD_SOURCE_ENUM_DIRECT                      1
#define SI446X_PROP_MODEM_MOD_TYPE_MOD_SOURCE_ENUM_PSEUDO                      2
#define SI446X_PROP_MODEM_MOD_TYPE_MOD_TYPE_SIZE                               3
#define SI446X_PROP_MODEM_MOD_TYPE_MOD_TYPE_LSB                                0
#define SI446X_PROP_MODEM_MOD_TYPE_MOD_TYPE_MSB                                2
#define SI446X_PROP_MODEM_MOD_TYPE_MOD_TYPE_MASK                               0x7
#define SI446X_PROP_MODEM_MOD_TYPE_MOD_TYPE_ENUM_CW                            0
#define SI446X_PROP_MODEM_MOD_TYPE_MOD_TYPE_ENUM_OOK                           1
#define SI446X_PROP_MODEM_MOD_TYPE_MOD_TYPE_ENUM_2FSK                          2
#define SI446X_PROP_MODEM_MOD_TYPE_MOD_TYPE_ENUM_2GFSK                         3
#define SI446X_PROP_MODEM_MOD_TYPE_MOD_TYPE_ENUM_4FSK                          4
#define SI446X_PROP_MODEM_MOD_TYPE_MOD_TYPE_ENUM_4GFSK                         5

#define SI446X_PROP_MODEM_MAP_CONTROL_MASK                                     0xFF
#define SI446X_PROP_MODEM_MAP_CONTROL_DEFAULT                                  0x80
#define SI446X_PROP_MODEM_MAP_CONTROL_ENMANCH_SIZE                             1
#define SI446X_PROP_MODEM_MAP_CONTROL_ENMANCH_LSB                              7
#define SI446X_PROP_MODEM_MAP_CONTROL_ENMANCH_MSB                              7
#define SI446X_PROP_MODEM_MAP_CONTROL_ENMANCH_MASK                             0x80
#define SI446X_PROP_MODEM_MAP_CONTROL_ENMANCH_BIT                              0x80
#define SI446X_PROP_MODEM_MAP_CONTROL_ENINV_RXBIT_SIZE                         1
#define SI446X_PROP_MODEM_MAP_CONTROL_ENINV_RXBIT_LSB                          6
#define SI446X_PROP_MODEM_MAP_CONTROL_ENINV_RXBIT_MSB                          6
#define SI446X_PROP_MODEM_MAP_CONTROL_ENINV_RXBIT_MASK                         0x40
#define SI446X_PROP_MODEM_MAP_CONTROL_ENINV_RXBIT_BIT                          0x40
#define SI446X_PROP_MODEM_MAP_CONTROL_ENINV_TXBIT_SIZE                         1
#define SI446X_PROP_MODEM_MAP_CONTROL_ENINV_TXBIT_LSB                          5
#define SI446X_PROP_MODEM_MAP_CONTROL_ENINV_TXBIT_MSB                          5
#define SI446X_PROP_MODEM_MAP_CONTROL_ENINV_TXBIT_MASK                         0x20
#define SI446X_PROP_MODEM_MAP_CONTROL_ENINV_TXBIT_BIT                          0x20
#define SI446X_PROP_MODEM_MAP_CONTROL_ENINV_FD_SIZE                            1
#define SI446X_PROP_MODEM_MAP_CONTROL_ENINV_FD_LSB                             4
#define SI446X_PROP_MODEM_MAP_CONTROL_ENINV_FD_MSB                             4
#define SI446X_PROP_MODEM_MAP_CONTROL_ENINV_FD_MASK                            0x10
#define SI446X_PROP_MODEM_MAP_CONTROL_ENINV_FD_BIT                             0x10


#define SI446X_PROP_MODEM_DATA_RATE_2_MASK                                     0xFF
#define SI446X_PROP_MODEM_DATA_RATE_2_DEFAULT                                  0x0F
#define SI446X_PROP_MODEM_DATA_RATE_2_DR_23_16_SIZE                            8
#define SI446X_PROP_MODEM_DATA_RATE_2_DR_23_16_LSB                             0
#define SI446X_PROP_MODEM_DATA_RATE_2_DR_23_16_MSB                             7
#define SI446X_PROP_MODEM_DATA_RATE_2_DR_23_16_MIN                             0
#define SI446X_PROP_MODEM_DATA_RATE_2_DR_23_16_MAX                             255
#define SI446X_PROP_MODEM_DATA_RATE_2_DR_23_16_MASK                            0xFF

