quinncnl/Si4463-on-EFM32ZG-STK3200/src/drivers/Si446x/si446x_defs.h
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE6_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE6_7_0_DEFAULT                     0xFC
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE6_7_0_RX1_CHFLT_COE6_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE6_7_0_RX1_CHFLT_COE6_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE6_7_0_RX1_CHFLT_COE6_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE6_7_0_RX1_CHFLT_COE6_7_0_MASK     0xFF

#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE5_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE5_7_0_DEFAULT                     0x1B
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE5_7_0_RX1_CHFLT_COE5_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE5_7_0_RX1_CHFLT_COE5_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE5_7_0_RX1_CHFLT_COE5_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE5_7_0_RX1_CHFLT_COE5_7_0_MASK     0xFF

#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE4_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE4_7_0_DEFAULT                     0x1E
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE4_7_0_RX1_CHFLT_COE4_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE4_7_0_RX1_CHFLT_COE4_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE4_7_0_RX1_CHFLT_COE4_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE4_7_0_RX1_CHFLT_COE4_7_0_MASK     0xFF

#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE3_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE3_7_0_DEFAULT                     0x0F
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE3_7_0_RX1_CHFLT_COE3_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE3_7_0_RX1_CHFLT_COE3_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE3_7_0_RX1_CHFLT_COE3_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE3_7_0_RX1_CHFLT_COE3_7_0_MASK     0xFF

#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE2_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE2_7_0_DEFAULT                     0x01
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE2_7_0_RX1_CHFLT_COE2_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE2_7_0_RX1_CHFLT_COE2_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE2_7_0_RX1_CHFLT_COE2_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE2_7_0_RX1_CHFLT_COE2_7_0_MASK     0xFF

#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE1_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE1_7_0_DEFAULT                     0xFC
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE1_7_0_RX1_CHFLT_COE1_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE1_7_0_RX1_CHFLT_COE1_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE1_7_0_RX1_CHFLT_COE1_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE1_7_0_RX1_CHFLT_COE1_7_0_MASK     0xFF

#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE0_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE0_7_0_DEFAULT                     0xFD
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE0_7_0_RX1_CHFLT_COE0_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE0_7_0_RX1_CHFLT_COE0_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE0_7_0_RX1_CHFLT_COE0_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE0_7_0_RX1_CHFLT_COE0_7_0_MASK     0xFF

#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM0_MASK                           0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM0_DEFAULT                        0x15
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM0_RX1COE10_9_8_SIZE              2
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM0_RX1COE10_9_8_LSB               6
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM0_RX1COE10_9_8_MSB               7
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM0_RX1COE10_9_8_MASK              0xC0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM0_RX1COE11_9_8_SIZE              2
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM0_RX1COE11_9_8_LSB               4
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM0_RX1COE11_9_8_MSB               5
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM0_RX1COE11_9_8_MASK              0x30
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM0_RX1COE12_9_8_SIZE              2
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM0_RX1COE12_9_8_LSB               2
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM0_RX1COE12_9_8_MSB               3
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM0_RX1COE12_9_8_MASK              0xC
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM0_RX1COE13_9_8_SIZE              2
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM0_RX1COE13_9_8_LSB               0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM0_RX1COE13_9_8_MSB               1
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM0_RX1COE13_9_8_MASK              0x3

#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM1_MASK                           0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM1_DEFAULT                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM1_RX1COE6_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM1_RX1COE6_9_8_LSB                6
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM1_RX1COE6_9_8_MSB                7
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM1_RX1COE6_9_8_MASK               0xC0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM1_RX1COE7_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM1_RX1COE7_9_8_LSB                4
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM1_RX1COE7_9_8_MSB                5
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM1_RX1COE7_9_8_MASK               0x30
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM1_RX1COE8_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM1_RX1COE8_9_8_LSB                2
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM1_RX1COE8_9_8_MSB                3
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM1_RX1COE8_9_8_MASK               0xC
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM1_RX1COE9_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM1_RX1COE9_9_8_LSB                0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM1_RX1COE9_9_8_MSB                1
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM1_RX1COE9_9_8_MASK               0x3

