quinncnl/Si4463-on-EFM32ZG-STK3200/src/drivers/Si446x/si446x_defs.h
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM2_MASK                           0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM2_DEFAULT                        0x00
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM2_RX1COE2_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM2_RX1COE2_9_8_LSB                6
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM2_RX1COE2_9_8_MSB                7
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM2_RX1COE2_9_8_MASK               0xC0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM2_RX1COE3_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM2_RX1COE3_9_8_LSB                4
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM2_RX1COE3_9_8_MSB                5
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM2_RX1COE3_9_8_MASK               0x30
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM2_RX1COE4_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM2_RX1COE4_9_8_LSB                2
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM2_RX1COE4_9_8_MSB                3
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM2_RX1COE4_9_8_MASK               0xC
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM2_RX1COE5_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM2_RX1COE5_9_8_LSB                0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM2_RX1COE5_9_8_MSB                1
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM2_RX1COE5_9_8_MASK               0x3

#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM3_MASK                           0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM3_DEFAULT                        0x0F
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM3_RX1COE0_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM3_RX1COE0_9_8_LSB                2
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM3_RX1COE0_9_8_MSB                3
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM3_RX1COE0_9_8_MASK               0xC
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM3_RX1COE1_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM3_RX1COE1_9_8_LSB                0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM3_RX1COE1_9_8_MSB                1
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COEM3_RX1COE1_9_8_MASK               0x3

#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE13_7_0_MASK                       0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE13_7_0_DEFAULT                    0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE13_7_0_RX2_CHFLT_COE13_7_0_SIZE   8
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE13_7_0_RX2_CHFLT_COE13_7_0_LSB    0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE13_7_0_RX2_CHFLT_COE13_7_0_MSB    7
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE13_7_0_RX2_CHFLT_COE13_7_0_MASK   0xFF

#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE12_7_0_MASK                       0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE12_7_0_DEFAULT                    0xC4
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE12_7_0_RX2_CHFLT_COE12_7_0_SIZE   8
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE12_7_0_RX2_CHFLT_COE12_7_0_LSB    0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE12_7_0_RX2_CHFLT_COE12_7_0_MSB    7
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE12_7_0_RX2_CHFLT_COE12_7_0_MASK   0xFF

#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE11_7_0_MASK                       0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE11_7_0_DEFAULT                    0x30
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE11_7_0_RX2_CHFLT_COE11_7_0_SIZE   8
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE11_7_0_RX2_CHFLT_COE11_7_0_LSB    0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE11_7_0_RX2_CHFLT_COE11_7_0_MSB    7
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE11_7_0_RX2_CHFLT_COE11_7_0_MASK   0xFF

#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE10_7_0_MASK                       0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE10_7_0_DEFAULT                    0x7F
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE10_7_0_RX2_CHFLT_COE10_7_0_SIZE   8
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE10_7_0_RX2_CHFLT_COE10_7_0_LSB    0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE10_7_0_RX2_CHFLT_COE10_7_0_MSB    7
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE10_7_0_RX2_CHFLT_COE10_7_0_MASK   0xFF

#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE9_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE9_7_0_DEFAULT                     0xF5
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE9_7_0_RX2_CHFLT_COE9_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE9_7_0_RX2_CHFLT_COE9_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE9_7_0_RX2_CHFLT_COE9_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE9_7_0_RX2_CHFLT_COE9_7_0_MASK     0xFF

#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE8_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE8_7_0_DEFAULT                     0xB5
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE8_7_0_RX2_CHFLT_COE8_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE8_7_0_RX2_CHFLT_COE8_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE8_7_0_RX2_CHFLT_COE8_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE8_7_0_RX2_CHFLT_COE8_7_0_MASK     0xFF

#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE7_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE7_7_0_DEFAULT                     0xB8
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE7_7_0_RX2_CHFLT_COE7_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE7_7_0_RX2_CHFLT_COE7_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE7_7_0_RX2_CHFLT_COE7_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE7_7_0_RX2_CHFLT_COE7_7_0_MASK     0xFF

#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE6_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE6_7_0_DEFAULT                     0xDE
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE6_7_0_RX2_CHFLT_COE6_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE6_7_0_RX2_CHFLT_COE6_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE6_7_0_RX2_CHFLT_COE6_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE6_7_0_RX2_CHFLT_COE6_7_0_MASK     0xFF

#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE5_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE5_7_0_DEFAULT                     0x05
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE5_7_0_RX2_CHFLT_COE5_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE5_7_0_RX2_CHFLT_COE5_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE5_7_0_RX2_CHFLT_COE5_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE5_7_0_RX2_CHFLT_COE5_7_0_MASK     0xFF

#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE4_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE4_7_0_DEFAULT                     0x17
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE4_7_0_RX2_CHFLT_COE4_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE4_7_0_RX2_CHFLT_COE4_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE4_7_0_RX2_CHFLT_COE4_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE4_7_0_RX2_CHFLT_COE4_7_0_MASK     0xFF

#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE3_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE3_7_0_DEFAULT                     0x16
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE3_7_0_RX2_CHFLT_COE3_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE3_7_0_RX2_CHFLT_COE3_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE3_7_0_RX2_CHFLT_COE3_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE3_7_0_RX2_CHFLT_COE3_7_0_MASK     0xFF

#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE2_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE2_7_0_DEFAULT                     0x0C
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE2_7_0_RX2_CHFLT_COE2_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE2_7_0_RX2_CHFLT_COE2_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE2_7_0_RX2_CHFLT_COE2_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE2_7_0_RX2_CHFLT_COE2_7_0_MASK     0xFF

