quinncnl/Si4463-on-EFM32ZG-STK3200/src/drivers/Si446x/si446x_defs.h
#define SI446X_PROP_PA_TC_MASK                                                 0xFF
#define SI446X_PROP_PA_TC_DEFAULT                                              0x5D
#define SI446X_PROP_PA_TC_FSK_MOD_DLY_SIZE                                     3
#define SI446X_PROP_PA_TC_FSK_MOD_DLY_LSB                                      5
#define SI446X_PROP_PA_TC_FSK_MOD_DLY_MSB                                      7
#define SI446X_PROP_PA_TC_FSK_MOD_DLY_MASK                                     0xE0
#define SI446X_PROP_PA_TC_FSK_MOD_DLY_ENUM_2_US                                0
#define SI446X_PROP_PA_TC_FSK_MOD_DLY_ENUM_6_US                                1
#define SI446X_PROP_PA_TC_FSK_MOD_DLY_ENUM_10_US                               2
#define SI446X_PROP_PA_TC_FSK_MOD_DLY_ENUM_14_US                               3
#define SI446X_PROP_PA_TC_FSK_MOD_DLY_ENUM_18_US                               4
#define SI446X_PROP_PA_TC_FSK_MOD_DLY_ENUM_22_US                               5
#define SI446X_PROP_PA_TC_FSK_MOD_DLY_ENUM_26_US                               6
#define SI446X_PROP_PA_TC_FSK_MOD_DLY_ENUM_30_US                               7
#define SI446X_PROP_PA_TC_TC_SIZE                                              5
#define SI446X_PROP_PA_TC_TC_LSB                                               0
#define SI446X_PROP_PA_TC_TC_MSB                                               4
#define SI446X_PROP_PA_TC_TC_MIN                                               0
#define SI446X_PROP_PA_TC_TC_MAX                                               31
#define SI446X_PROP_PA_TC_TC_MASK                                              0x1F

#define SI446X_PROP_PA_RAMP_EX_MASK                                            0xFF
#define SI446X_PROP_PA_RAMP_EX_DEFAULT                                         0x00
#define SI446X_PROP_PA_RAMP_EX_VSET_SIZE                                       4
#define SI446X_PROP_PA_RAMP_EX_VSET_LSB                                        4
#define SI446X_PROP_PA_RAMP_EX_VSET_MSB                                        7
#define SI446X_PROP_PA_RAMP_EX_VSET_MIN                                        0
#define SI446X_PROP_PA_RAMP_EX_VSET_MAX                                        15
#define SI446X_PROP_PA_RAMP_EX_VSET_MASK                                       0xF0
#define SI446X_PROP_PA_RAMP_EX_TC_SIZE                                         4
#define SI446X_PROP_PA_RAMP_EX_TC_LSB                                          0
#define SI446X_PROP_PA_RAMP_EX_TC_MSB                                          3
#define SI446X_PROP_PA_RAMP_EX_TC_MIN                                          0
#define SI446X_PROP_PA_RAMP_EX_TC_MAX                                          15
#define SI446X_PROP_PA_RAMP_EX_TC_MASK                                         0xF

#define SI446X_PROP_PA_RAMP_DOWN_DELAY_MASK                                    0xFF
#define SI446X_PROP_PA_RAMP_DOWN_DELAY_DEFAULT                                 0x23
#define SI446X_PROP_PA_RAMP_DOWN_DELAY_RAMP_DOWN_DELAY_SIZE                    8
#define SI446X_PROP_PA_RAMP_DOWN_DELAY_RAMP_DOWN_DELAY_LSB                     0
#define SI446X_PROP_PA_RAMP_DOWN_DELAY_RAMP_DOWN_DELAY_MSB                     7
#define SI446X_PROP_PA_RAMP_DOWN_DELAY_RAMP_DOWN_DELAY_MIN                     1
#define SI446X_PROP_PA_RAMP_DOWN_DELAY_RAMP_DOWN_DELAY_MAX                     40
#define SI446X_PROP_PA_RAMP_DOWN_DELAY_RAMP_DOWN_DELAY_MASK                    0xFF










#define SI446X_PROP_MATCH_VALUE_1_MASK                                         0xFF
#define SI446X_PROP_MATCH_VALUE_1_DEFAULT                                      0x00
#define SI446X_PROP_MATCH_VALUE_1_VALUE_1_SIZE                                 8
#define SI446X_PROP_MATCH_VALUE_1_VALUE_1_LSB                                  0
#define SI446X_PROP_MATCH_VALUE_1_VALUE_1_MSB                                  7
#define SI446X_PROP_MATCH_VALUE_1_VALUE_1_MIN                                  0
#define SI446X_PROP_MATCH_VALUE_1_VALUE_1_MAX                                  0xFF
#define SI446X_PROP_MATCH_VALUE_1_VALUE_1_MASK                                 0xFF

#define SI446X_PROP_MATCH_MASK_1_MASK                                          0xFF
#define SI446X_PROP_MATCH_MASK_1_DEFAULT                                       0x00
#define SI446X_PROP_MATCH_MASK_1_MASK_1_SIZE                                   8
#define SI446X_PROP_MATCH_MASK_1_MASK_1_LSB                                    0
#define SI446X_PROP_MATCH_MASK_1_MASK_1_MSB                                    7
#define SI446X_PROP_MATCH_MASK_1_MASK_1_MIN                                    0
#define SI446X_PROP_MATCH_MASK_1_MASK_1_MAX                                    0xFF
#define SI446X_PROP_MATCH_MASK_1_MASK_1_MASK                                   0xFF

#define SI446X_PROP_MATCH_CTRL_1_MASK                                          0xFF
#define SI446X_PROP_MATCH_CTRL_1_DEFAULT                                       0x00
#define SI446X_PROP_MATCH_CTRL_1_POLARITY_SIZE                                 1
#define SI446X_PROP_MATCH_CTRL_1_POLARITY_LSB                                  7
#define SI446X_PROP_MATCH_CTRL_1_POLARITY_MSB                                  7
#define SI446X_PROP_MATCH_CTRL_1_POLARITY_MASK                                 0x80
#define SI446X_PROP_MATCH_CTRL_1_POLARITY_BIT                                  0x80
#define SI446X_PROP_MATCH_CTRL_1_MATCH_EN_SIZE                                 1
#define SI446X_PROP_MATCH_CTRL_1_MATCH_EN_LSB                                  6
#define SI446X_PROP_MATCH_CTRL_1_MATCH_EN_MSB                                  6
#define SI446X_PROP_MATCH_CTRL_1_MATCH_EN_MASK                                 0x40
#define SI446X_PROP_MATCH_CTRL_1_MATCH_EN_BIT                                  0x40
#define SI446X_PROP_MATCH_CTRL_1_MATCH_EN_ENUM_MATCH_ENABLE                    1
#define SI446X_PROP_MATCH_CTRL_1_OFFSET_SIZE                                   5
#define SI446X_PROP_MATCH_CTRL_1_OFFSET_LSB                                    0
#define SI446X_PROP_MATCH_CTRL_1_OFFSET_MSB                                    4
#define SI446X_PROP_MATCH_CTRL_1_OFFSET_MIN                                    0
#define SI446X_PROP_MATCH_CTRL_1_OFFSET_MAX                                    0x1F
#define SI446X_PROP_MATCH_CTRL_1_OFFSET_MASK                                   0x1F

#define SI446X_PROP_MATCH_VALUE_2_MASK                                         0xFF
#define SI446X_PROP_MATCH_VALUE_2_DEFAULT                                      0x00
#define SI446X_PROP_MATCH_VALUE_2_VALUE_2_SIZE                                 8
#define SI446X_PROP_MATCH_VALUE_2_VALUE_2_LSB                                  0
#define SI446X_PROP_MATCH_VALUE_2_VALUE_2_MSB                                  7
#define SI446X_PROP_MATCH_VALUE_2_VALUE_2_MIN                                  0
#define SI446X_PROP_MATCH_VALUE_2_VALUE_2_MAX                                  0xFF
#define SI446X_PROP_MATCH_VALUE_2_VALUE_2_MASK                                 0xFF

