quinncnl/Si4463-on-EFM32ZG-STK3200/src/drivers/Si446x/si446x_defs.h
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_31_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_31_DEFAULT                              31
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_31_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_31_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_31_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_31_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_31_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_31_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_31_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_32_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_32_DEFAULT                              32
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_32_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_32_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_32_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_32_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_32_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_32_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_32_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_33_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_33_DEFAULT                              33
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_33_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_33_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_33_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_33_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_33_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_33_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_33_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_34_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_34_DEFAULT                              34
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_34_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_34_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_34_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_34_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_34_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_34_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_34_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_35_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_35_DEFAULT                              35
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_35_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_35_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_35_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_35_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_35_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_35_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_35_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_36_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_36_DEFAULT                              36
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_36_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_36_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_36_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_36_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_36_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_36_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_36_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_37_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_37_DEFAULT                              37
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_37_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_37_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_37_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_37_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_37_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_37_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_37_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_38_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_38_DEFAULT                              38
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_38_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_38_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_38_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_38_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_38_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_38_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_38_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_39_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_39_DEFAULT                              39
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_39_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_39_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_39_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_39_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_39_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_39_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_39_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_40_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_40_DEFAULT                              40
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_40_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_40_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_40_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_40_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_40_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_40_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_40_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_41_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_41_DEFAULT                              41
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_41_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_41_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_41_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_41_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_41_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_41_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_41_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_42_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_42_DEFAULT                              42
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_42_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_42_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_42_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_42_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_42_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_42_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_42_CHANNEL_NUM_ENUM_INVALID             255

