quinncnl/Si4463-on-EFM32ZG-STK3200/src/drivers/Si446x/si446x_defs.h
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_43_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_43_DEFAULT                              43
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_43_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_43_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_43_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_43_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_43_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_43_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_43_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_44_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_44_DEFAULT                              44
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_44_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_44_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_44_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_44_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_44_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_44_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_44_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_45_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_45_DEFAULT                              45
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_45_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_45_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_45_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_45_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_45_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_45_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_45_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_46_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_46_DEFAULT                              46
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_46_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_46_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_46_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_46_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_46_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_46_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_46_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_47_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_47_DEFAULT                              47
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_47_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_47_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_47_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_47_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_47_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_47_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_47_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_48_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_48_DEFAULT                              48
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_48_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_48_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_48_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_48_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_48_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_48_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_48_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_49_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_49_DEFAULT                              49
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_49_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_49_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_49_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_49_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_49_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_49_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_49_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_50_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_50_DEFAULT                              50
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_50_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_50_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_50_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_50_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_50_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_50_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_50_CHANNEL_NUM_ENUM_INVALID             255

